app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'swetaacharya890@gmail.com'
 LIMIT 1
UPDATE `users` SET `username` = 'admin', `password` = '$2y$10$RyB33A1C7gbhdqiY4Mpe5uO7aDd5rqLLCNGOul6cwwqdGTG8OGbaG', `email` = 'swetaacharya890@gmail.com', `role` = 'admin'
WHERE `users`.`id` IN ('27')
---
public function sendOtp()
{
    $email = $this->request->getPost('email');
    $model = new UserModel();
    $user = $model->where('email', $email)->first();

    if (!$user) {
        session()->setFlashdata('msg', 'Email not found');
        return redirect()->to(base_url('/auth/forgotPassword'));
    }

    $otp = rand(100000, 999999); // Generate OTP
    $otpExpiry = Time::now()->addMinutes(10); // OTP valid for 10 minutes

    $user['otp'] = $otp;
    $user['otp_expiry'] = $otpExpiry->toDateTimeString();
    $model->save($user);